test/wsdls/keefe/vendor_payment/vendor_payment_svc/VendorPaymentSvc.svc?wsdl=wsdl0

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions targetNamespace="http://www.keefecommissary.net/VendorPaymentService/v0101" 
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
    xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" 
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
    xmlns:wsa10="http://www.w3.org/2005/08/addressing" 
    xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" 
    xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" 
    xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" 
    xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" 
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" 
    xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:tns="http://www.keefecommissary.net/VendorPaymentService/v0101" 
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
    xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" 
    xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
    <wsdl:types>
        <xsd:schema targetNamespace="http://www.keefecommissary.net/VendorPaymentService/v0101/Imports">
            <xsd:import schemaLocation="https://services.keefegp.com/VendorPayment/VendorPaymentSvc.svc?xsd=xsd0" namespace="http://www.keefecommissary.net/VendorPaymentService/v0101"/>
            <xsd:import schemaLocation="https://services.keefegp.com/VendorPayment/VendorPaymentSvc.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/>
            <xsd:import schemaLocation="https://services.keefegp.com/VendorPayment/VendorPaymentSvc.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/PaymentServiceEngine"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="IVendorPaymentSvc_RegisterDepositor_InputMessage">
        <wsdl:part name="parameters" element="tns:RegisterDepositor"/>
    </wsdl:message>
    <wsdl:message name="IVendorPaymentSvc_RegisterDepositor_OutputMessage">
        <wsdl:part name="parameters" element="tns:RegisterDepositorResponse"/>
    </wsdl:message>
    <wsdl:message name="IVendorPaymentSvc_PreValidateDeposit_InputMessage">
        <wsdl:part name="parameters" element="tns:PreValidateDeposit"/>
    </wsdl:message>
    <wsdl:message name="IVendorPaymentSvc_PreValidateDeposit_OutputMessage">
        <wsdl:part name="parameters" element="tns:PreValidateDepositResponse"/>
    </wsdl:message>
    <wsdl:message name="IVendorPaymentSvc_PostDeposit_InputMessage">
        <wsdl:part name="parameters" element="tns:PostDeposit"/>
    </wsdl:message>
    <wsdl:message name="IVendorPaymentSvc_PostDeposit_OutputMessage">
        <wsdl:part name="parameters" element="tns:PostDepositResponse"/>
    </wsdl:message>
    <wsdl:message name="IVendorPaymentSvc_LookupRecipient_InputMessage">
        <wsdl:part name="parameters" element="tns:LookupRecipient"/>
    </wsdl:message>
    <wsdl:message name="IVendorPaymentSvc_LookupRecipient_OutputMessage">
        <wsdl:part name="parameters" element="tns:LookupRecipientResponse"/>
    </wsdl:message>
    <wsdl:message name="IVendorPaymentSvc_VoidDeposit_InputMessage">
        <wsdl:part name="parameters" element="tns:VoidDeposit"/>
    </wsdl:message>
    <wsdl:message name="IVendorPaymentSvc_VoidDeposit_OutputMessage">
        <wsdl:part name="parameters" element="tns:VoidDepositResponse"/>
    </wsdl:message>
    <wsdl:portType name="IVendorPaymentSvc">
        <wsdl:operation name="RegisterDepositor">
            <wsdl:input wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/RegisterDepositor" message="tns:IVendorPaymentSvc_RegisterDepositor_InputMessage"/>
            <wsdl:output wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/RegisterDepositorResponse" message="tns:IVendorPaymentSvc_RegisterDepositor_OutputMessage"/>
        </wsdl:operation>
        <wsdl:operation name="PreValidateDeposit">
            <wsdl:input wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/PreValidateDeposit" message="tns:IVendorPaymentSvc_PreValidateDeposit_InputMessage"/>
            <wsdl:output wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/PreValidateDepositResponse" message="tns:IVendorPaymentSvc_PreValidateDeposit_OutputMessage"/>
        </wsdl:operation>
        <wsdl:operation name="PostDeposit">
            <wsdl:input wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/PostDeposit" message="tns:IVendorPaymentSvc_PostDeposit_InputMessage"/>
            <wsdl:output wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/PostDepositResponse" message="tns:IVendorPaymentSvc_PostDeposit_OutputMessage"/>
        </wsdl:operation>
        <wsdl:operation name="LookupRecipient">
            <wsdl:input wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/LookupRecipient" message="tns:IVendorPaymentSvc_LookupRecipient_InputMessage"/>
            <wsdl:output wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/LookupRecipientResponse" message="tns:IVendorPaymentSvc_LookupRecipient_OutputMessage"/>
        </wsdl:operation>
        <wsdl:operation name="VoidDeposit">
            <wsdl:input wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/VoidDeposit" message="tns:IVendorPaymentSvc_VoidDeposit_InputMessage"/>
            <wsdl:output wsaw:Action="http://www.keefecommissary.net/VendorPaymentService/v0101/IVendorPaymentSvc/VoidDepositResponse" message="tns:IVendorPaymentSvc_VoidDeposit_OutputMessage"/>
        </wsdl:operation>
    </wsdl:portType>
</wsdl:definitions>